{
    "versions": {
        "2.1.3": [
            "Server Export Added: VehicleInsuranceInfo",
            "Server Event Added: hoch_morsmutual:insuranceStatusUpdated",
            "Client Event Added:hoch_morsmutual:claimCompleted"
        ],
        "2.1.2": [
            "Added support for 17movement phone"
        ],
        "2.1.1": [
            "Added support for GKS Phone",
            "Refactored vehicle deletion logic",
            "Improved client-side vehicle network ID retrieval."
        ],
        "2.1.0": [
            "YSERIES SUPPORT",
            "Appkit refactor, backend enhancements for supporting more phones"
        ],
        "2.0.4": [
            "Added support for RxBanking"
        ],
        "2.0.3": [
            "Updated locales and added currency selection to config"
        ],
        "2.0.2": [
            "Added support for the new 'vms_garagesv2' integration in vehicle management."
        ],
        "2.0.1": [
            "Updated app description for clarity and improved user engagement.",
            "Adjusted paths for local icons in the app configuration.",
            "Enhanced vehicle deletion logic in events to prioritize framework-specific handling.",
            "Included server config values in insurance data for accurate premium calculations in UI components.",
            "Improved vehicle make and model retrieval logic to utilize framework-specific lookups, ensuring better compatibility across different frameworks."
        ],
        "2.0.0": [
            "Added built-in integrations for QBCore, QBox, and ESX frameworks",
            "Added native support for 10+ banking resources (Renewed-Banking, wasabi_banking, okokBanking, and more)",
            "Added native support for popular garage resources (jg-advancedgarages, cd_garage, qs-advancedgarage)",
            "Added phone notifications for claim updates and payment reminders",
            "Added automatic version checker with patch notes on server start",
            "Completely rebuilt UI using React for improved performance",
            "Redesigned unlocked folder with modular per-resource integration files",
            "Upgraded to Lua 5.4 for better performance",
            "Simplified configuration with auto-detection for framework, banking, and garage",
            "Removed community_bridge dependency — all integrations are now built-in"
        ]
    }
}